52n-sos-webapp/src/main/webapp/examples/sos_v20/requests_soap/DescribeSensor.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope">
	<env:Body>
		<swes:DescribeSensor service="SOS" version="2.0.0"
			xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<swes:procedure>http://www.my_namespace.org/sensors/1</swes:procedure>
			<swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
		</swes:DescribeSensor>
	</env:Body>
</env:Envelope>